module.exports = {
  mat: {
    1: ["Железный", "Кожаный", "Медный", "Ржавый", "Сыромятный", "Деревянный", "Меховой", "Грубый"],
    2: ["Стальной", "Клёпаный", "Хитиновый", "Костяной", "Бронзовый", "Серебряный"],
    3: ["Двемерский", "Эльфийский", "Ртутный", "Орочий", "Луннокаменный", "Резной"],
    4: ["Эбонитовый", "Стеклянный", "Сталгримовый", "Нордский", "Мифриловый"],
    5: ["Даэдрический", "Драконий", "Костяной дракона", "Адамантовый"]
  },
  mult: { 1: 1, 2: 2, 3: 3, 4: 5, 5: 8 },
  cost_min: { 1: 10, 2: 50, 3: 250, 4: 1200, 5: 5000 },
  cost_max: { 1: 25, 2: 120, 3: 500, 4: 2800, 5: 12000 },
  
  type_weapon: ["Меч", "Топор", "Булава", "Кинжал", "Двуручник", "Копье", "Секира", "Боевой молот", "Клеймор"],
  type_armor: ["Кираса", "Броня", "Кольчуга", "Доспех", "Нагрудник", "Латы", "Панцирь", "Одеяние Мага"],
  type_jewel: ["Амулет", "Кольцо", "Ожерелье", "Перстень", "Медальон", "Обруч"],
  type_offhand: ["Щит", "Стилет", "Фолиант", "Гримуар", "Оберег", "Тарч", "Резной щит"],
  type_potion: ["Экстракт Силы", "Настойка Ловкости", "Кровь Тролля", "Отвар Стойкости", "Зелье Удачи", "Зелье Точности", "Напиток Вампира", "Зелье Берсерка", "Зелье Железной Кожи", "Эликсир Отражения"],

  base_weapon: { min: 5, max: 15 },
  base_armor: { min: 10, max: 25 },
  base_offhand: { min: 5, max: 15 },
  
  potion_buff: { min: 5, max: 15 },
  potion_dur: { min: 300, max: 600 },
  
  // Эффекты зелий (Buffs)
  potion_effects: {
    "Экстракт Силы": { stat: "strength", value: 15, duration: 12 },
    "Настойка Ловкости": { stat: "dexterity", value: 10, duration: 12 },
    "Кровь Тролля": { stat: "constitution", value: 20, duration: 24 },
    "Отвар Стойкости": { stat: "physical_defense", value: 15, duration: 12 },
    "Зелье Удачи": { stat: "luck", value: 15, duration: 24 },
    "Зелье Точности": { stat: "accuracy", value: 20, duration: 12 },
    "Напиток Вампира": { stat: "vamp", value: 10, duration: 12 },
    "Зелье Берсерка": { stat: "crit", value: 15, duration: 12 },
    "Зелье Железной Кожи": { stat: "physical_defense", value: 25, duration: 18 },
    "Эликсир Отражения": { stat: "dodge", value: 15, duration: 12 }
  },

  fx_crit: { min: 5, max: 15 },
  fx_vamp: { min: 2, max: 8 },
  fx_trade: { min: 5, max: 25 },
  fx_dodge: { min: 3, max: 12 },

  curses: { drain: 15, trade: -40, fragile: -20, slow: -10 }
};
